In [1]:
import pandas as pd

In [2]:
# Series

In [3]:
l=[1,2,3,4,5]
x=pd.Series(l)
x

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
x.values

array([1, 2, 3, 4, 5], dtype=int64)

In [5]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
i=['a','b','c','d','e']
x.index=i
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
# new series
x=pd.Series([100,433,65565,3434,343],index=['usa','ind','aus','can','chi'])
x

usa      100
ind      433
aus    65565
can     3434
chi      343
dtype: int64

In [9]:
x[1]

433

In [10]:
x['usa']

100

In [11]:
x[0:3]

usa      100
ind      433
aus    65565
dtype: int64

In [12]:
x[::-1]

chi      343
can     3434
aus    65565
ind      433
usa      100
dtype: int64

In [13]:
x[x>400]

ind      433
aus    65565
can     3434
dtype: int64

In [14]:
pd.isnull(x)

usa    False
ind    False
aus    False
can    False
chi    False
dtype: bool

In [16]:
pd.notnull(x)

usa    True
ind    True
aus    True
can    True
chi    True
dtype: bool

In [19]:
x.index.name='countries'
x

countries
usa      100
ind      433
aus    65565
can     3434
chi      343
dtype: int64

In [28]:
ser3 = pd.Series(['USA','Mexico','Canada'],index=[0,5,10])

In [33]:
ser3.reindex(range(12),method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
dtype: object

In [34]:
x=pd.Series([100,433,65565,3434,343],index=['usa','ind','aus','can','chi'])
y=pd.Series([200,333,565,9434,1343],index=['usa','ind','aus','can','chi'])

In [35]:
x+y

usa      300
ind      766
aus    66130
can    12868
chi     1686
dtype: int64

In [36]:
y.index=['usa','ind','aus','can','ban']

In [46]:
a=x+y

In [48]:
a.dropna()

aus    66130.0
ban        NaN
can    12868.0
chi        NaN
ind      766.0
usa      300.0
dtype: float64

# dataframes

In [63]:
dict = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597, 1.221],
"population":[200.4, 143.5, 1252,1357,52.98]}
data=pd.DataFrame(dict)
data

     area    capital       country  population
0   8.516   Brasilia        Brazil      200.40
1  17.100     Moscow        Russia      143.50
2   3.286  New Delhi         India     1252.00
3   9.597    Beijing         China     1357.00
4   1.221   Pretoria  South Africa       52.98

In [52]:
data.index

RangeIndex(start=0, stop=5, step=1)

In [53]:
data.columns

Index(['area', 'capital', 'country', 'population'], dtype='object')

In [55]:
data['area'] # series

0     8.516
1    17.100
2     3.286
3     9.597
4     1.221
Name: area, dtype: float64

In [56]:
data[['area']]

     area
0   8.516
1  17.100
2   3.286
3   9.597
4   1.221

In [57]:
# Rename columns
newcolumns=['Area', 'Capital', 'Country', 'Population']
data.columns=newcolumns
data

     Area    Capital       Country  Population
0   8.516   Brasilia        Brazil      200.40
1  17.100     Moscow        Russia      143.50
2   3.286  New Delhi         India     1252.00
3   9.597    Beijing         China     1357.00
4   1.221   Pretoria  South Africa       52.98

In [58]:
# renaming index
data.index=(['a','b','c','d','e'])
data

     Area    Capital       Country  Population
a   8.516   Brasilia        Brazil      200.40
b  17.100     Moscow        Russia      143.50
c   3.286  New Delhi         India     1252.00
d   9.597    Beijing         China     1357.00
e   1.221   Pretoria  South Africa       52.98

In [59]:
del data['Country'] # deleting columns

In [62]:
data.drop(data.columns[0:3],axis=1) # deleting multiple columns

Empty DataFrame
Columns: []
Index: [a, b, c, d, e]

In [64]:
# rename columns specific
data

     area    capital       country  population
0   8.516   Brasilia        Brazil      200.40
1  17.100     Moscow        Russia      143.50
2   3.286  New Delhi         India     1252.00
3   9.597    Beijing         China     1357.00
4   1.221   Pretoria  South Africa       52.98

In [66]:
data.rename(columns={'area':'Area','capital':'Capital'},inplace=True)
data

     Area    Capital       country  population
0   8.516   Brasilia        Brazil      200.40
1  17.100     Moscow        Russia      143.50
2   3.286  New Delhi         India     1252.00
3   9.597    Beijing         China     1357.00
4   1.221   Pretoria  South Africa       52.98

In [ ]:
# data conversion and creating new datetime columns
tables['Year_Date'] = pd.to_datetime(tables['Created Date'])
tables['Year']=(tables['Year_Date']).dt.year
tables['Hour'] = pd.to_datetime(tables['Created Date']).dt.hour
tables['Resolution_Time']=(tables['Closed Date']- tables['Created Date']).dt.days

In [69]:
# Indexing
data

     Area    Capital       country  population
0   8.516   Brasilia        Brazil      200.40
1  17.100     Moscow        Russia      143.50
2   3.286  New Delhi         India     1252.00
3   9.597    Beijing         China     1357.00
4   1.221   Pretoria  South Africa       52.98

In [70]:
data[1:4]

     Area    Capital country  population
1  17.100     Moscow  Russia       143.5
2   3.286  New Delhi   India      1252.0
3   9.597    Beijing   China      1357.0

In [71]:
data[['Area','country']]

     Area       country
0   8.516        Brazil
1  17.100        Russia
2   3.286         India
3   9.597         China
4   1.221  South Africa

In [74]:
# Using loc and iloc

In [76]:
data.loc[:,['Area','country']]

     Area       country
0   8.516        Brazil
1  17.100        Russia
2   3.286         India
3   9.597         China
4   1.221  South Africa

In [77]:
data.loc[1:3,['Area','country']] # only 2-4 rows

     Area country
1  17.100  Russia
2   3.286   India
3   9.597   China

In [78]:
data.index=["BR", "RU", "IN", "CH", "SA"]
data

      Area    Capital       country  population
BR   8.516   Brasilia        Brazil      200.40
RU  17.100     Moscow        Russia      143.50
IN   3.286  New Delhi         India     1252.00
CH   9.597    Beijing         China     1357.00
SA   1.221   Pretoria  South Africa       52.98

In [79]:
data.loc[['BR','IN'],:]

     Area    Capital country  population
BR  8.516   Brasilia  Brazil       200.4
IN  3.286  New Delhi   India      1252.0

In [80]:
data.iloc[[0,2],:] # instead of names, using indexes

     Area    Capital country  population
BR  8.516   Brasilia  Brazil       200.4
IN  3.286  New Delhi   India      1252.0

In [81]:
data.iloc[1:3,0:3]

      Area    Capital country
RU  17.100     Moscow  Russia
IN   3.286  New Delhi   India

In [82]:
area = pd.Series({'California': 423967, 'Texas': 695662,
'New York': 141297, 'Florida': 170312,
'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127, 'Florida': 19552860,
'Illinois': 12882135})

In [83]:
data=pd.DataFrame({'Area':area,'Popu':pop})
data

              Area      Popu
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [85]:
data['density'] = data['Popu'] / data['Area']
data

              Area      Popu     density
California  423967  38332521   90.413926
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763
New York    141297  19651127  139.076746
Texas       695662  26448193   38.018740

In [88]:
data.loc[data.Area>200000,['Area','Popu']]

              Area      Popu
California  423967  38332521
Texas       695662  26448193

In [89]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [90]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [91]:
age = pd.cut(titanic['age'], [0, 18, 80])

In [92]:
titanic.pivot_table('survived', ['sex',age], columns='class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [97]:
chipo=pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv',sep='\t')
chipo.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [99]:
chipo.shape[0]

4622

In [100]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [101]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [112]:
# Which was the most ordered item
a=chipo.groupby('item_name')['quantity'].sum()
a.sort_values(ascending=False).head(1)

item_name
Chicken Bowl    761
Name: quantity, dtype: int64

In [116]:
# What was the most ordered item in the choice_description column?
a=chipo.groupby('choice_description')['quantity'].sum()
a.sort_values(ascending=False).head(1)

choice_description
[Diet Coke]    159
Name: quantity, dtype: int64

In [118]:
# How many items were orderd in total?
a=chipo.quantity.sum()
a

4972

In [125]:
chipo.dtypes

order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

In [124]:
chipo['item_price']=chipo.item_price.str.strip('$')
chipo['item_price'] = pd.to_numeric(chipo['item_price'])

In [132]:
# How much was the revenue for the period in the dataset?
(chipo['quantity']*chipo['item_price']).sum()

39237.020000000055

In [135]:
# What is the average amount per order?
chipo.groupby('order_id')['item_price'].sum().mean()

18.81142857142869

In [136]:
# How many different items are sold?
chipo.item_name.value_counts().count()

50